HVAC Zones must be in the Main Model.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotPutZoneInOption { get; }
  Visual Basic
Public Shared ReadOnly Property CannotPutZoneInOption As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotPutZoneInOption {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures DesignOptionFailures Class
  Autodesk.Revit.DB Namespace